constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            patch;
        nFaces          1976;
        startFace       1498422;
    }
    outlet
    {
        type            patch;
        nFaces          1976;
        startFace       1500398;
    }
    waterplane
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          11764;
        startFace       1502374;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          798;
        startFace       1514138;
    }
    side
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          4368;
        startFace       1514936;
    }
    midPlane
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          16478;
        startFace       1519304;
    }
    hull
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          11326;
        startFace       1535782;
    }
)

// ************************************************************************* //
