system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    // "alpha.water.*"
    // {
    //     nAlphaCorr      2;
    //     nAlphaSubCycles 1;

    //     MULESCorr       yes;
    //     nLimiterIter    5;
    //     alphaApplyPrevCorr  yes;

    //     solver          smoothSolver;
    //     smoother        symGaussSeidel;
    //     tolerance       1e-8;
    //     relTol          0;
    //     minIter         1;
    // }

    "pcorr.*"
    {
        solver          PCG;

        preconditioner
        {
            preconditioner  GAMG;

            smoother        GaussSeidel;

            tolerance       1e-5;
            relTol          0;
        };

        tolerance       1e-5;
        relTol          0;
    }

    p_rgh
    {
        solver          GAMG;

        smoother        DIC;

        tolerance       1e-7;
        relTol          0.01;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }

    p
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-7;
        relTol          0.01;
    }

    Phi
    {
        $p;
    }

    "(U|k|omega).*"
    {
        solver          smoothSolver;

        smoother        symGaussSeidel;
        nSweeps         1;

        // tolerance       1e-7;
        tolerance 1e-8;
        relTol          0.1;
        minIter         1;
    }
}

// PIMPLE
// {
//     momentumPredictor   no;

//     nOuterCorrectors    1;
//     nCorrectors         2;
//     nNonOrthogonalCorrectors 0;

//     maxCo               10;
//     maxAlphaCo          1;

//     rDeltaTSmoothingCoeff 0.05;
//     rDeltaTDampingCoeff 0.5;
//     nAlphaSpreadIter    0;
//     nAlphaSweepIter     0;
//     maxDeltaT           1;
// }

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    consistent yes;
}

potentialFlow
{
    nNonOrthogonalCorrectors 10;
}

// relaxationFactors
// {
//     equations
//     {
//         ".*" 1;
//     }
// }

relaxationFactors
{
    equations
    {
        U 0.9;
        k 0.5;
        omega 0.5;
    }
}

cache
{
    grad(U);
}


// ************************************************************************* //
